---
title: MEPNetworkIterator
classe: Autodesk.Revit.DB.Analysis.MEPNetworkIterator
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# MEPNetworkIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CurrentElementId { get; }` | `mEPNetworkIterator.CurrentElementId` | ElementId |
| `Boolean IsValidObject { get; }` | `mEPNetworkIterator.IsValidObject` | Boolean |
| `MEPSystemClassification SystemClassification { get; set; }` | `mEPNetworkIterator.SystemClassification` | MEPSystemClassification |
| `ElementId SystemId { get; set; }` | `mEPNetworkIterator.SystemId` | ElementId |
| `Void Dispose()` | `mEPNetworkIterator.Dispose()` | Void |
| `Boolean End()` | `mEPNetworkIterator.End()` | Boolean |
| `MEPAnalyticalModelData GetAnalyticalModelData()` | `mEPNetworkIterator.GetAnalyticalModelData()` | MEPAnalyticalModelData |
| `MEPAnalyticalNode GetAnalyticalNode()` | `mEPNetworkIterator.GetAnalyticalNode()` | MEPAnalyticalNode |
| `MEPAnalyticalSegment GetAnalyticalSegment()` | `mEPNetworkIterator.GetAnalyticalSegment()` | MEPAnalyticalSegment |
| `MEPAnalyticalNode GetOtherAnalyticalNode()` | `mEPNetworkIterator.GetOtherAnalyticalNode()` | MEPAnalyticalNode |
| `Void Next()` | `mEPNetworkIterator.Next()` | Void |
| `Void Start()` | `mEPNetworkIterator.Start()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```